In [ ]:
age = input('writ your age ? ')

if age.isdigit ():
    age = int(age)
    print('My age is : ',age)
    
else :
    print('Warning! invalid age, write in digit')

In [7]:
age_01= input('writ your age ? ')

if age_01.isdigit ():
    age_01 = int(age_01)
    print('My age is : ',age)
    
else :
    print('Warning! invalid age, write in digit')

Warning! invalid age, write in digit

In [8]:
age_02= input('what is your age')

if age_02.isdigit():
    age_02 = int(age_02)
    print('My age is : ', age_02)
    
else :
    print('Warning ! invalid option, write  a numeric value')

Warning ! invalid option, write  a numeric value

In [2]:
# Splite function
name, age = input('Write  your name, and age separated by a space: ').split()
print('Hello,  ' + name + ' ! you age is : ' + age)

Hello,  abid ! you age is : 30

In [10]:
name, price = input('Write your fruit name , and price separated by a space: ').split()
print('You buy fruit: '+ name+ ' and his price is: '+ price)
# print('Hello,  ' + name+ ' ! you age is : ' + price)

TypeError: 'str' object is not callable

# EDA

In [11]:
# import libraries
import pandas as pd
# load the data
df = pd.read_excel(r"D:\Data_Science data\Python_ka_Chila\dataframe\titanic.xlsx")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Composition

In [2]:
df.dtypes

survived         int64
pclass           int64
sex             object
age            float64
sibsp            int64
parch            int64
fare           float64
embarked        object
class           object
who             object
adult_male        bool
deck            object
embark_town     object
alive           object
alone             bool
dtype: object

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [5]:
df.shape

(891, 15)

In [6]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [7]:
df.age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [8]:
df.shape[1]

15

In [9]:
df.shape[0]

891

In [12]:
len(df)

891

In [19]:
df['sex'].value_counts()/len(df) *100
# round off the value in 2 decimal number 
print(round(df['sex'].value_counts()/len(df))*100 , 2))

SyntaxError: unmatched ')' (928267420.py, line 3)

In [18]:
 df['class'].value_counts()/len(df)*100

class
Third     55.106622
First     24.242424
Second    20.650954
Name: count, dtype: float64

In [23]:
df.groupby(['sex']).size()/len(df)*100

sex
female    35.241302
male      64.758698
dtype: float64

In [30]:
dt = df.groupby(['sex', 'deck']).size()/ len(df)*100
round(dt,2).sort_values(ascending=False)

sex     deck
male    C       3.59
female  C       3.03
        B       3.03
male    B       2.24
female  D       2.02
male    E       1.91
female  E       1.68
male    D       1.68
        A       1.57
        F       0.90
female  F       0.56
        G       0.45
        A       0.11
dtype: float64

In [34]:
df_females= df[df['sex']=='female']
df_females['class'].value_counts()/len(df) *100

class
Third     16.161616
First     10.549944
Second     8.529742
Name: count, dtype: float64

In [33]:
df_females = df[df['sex'] == 'female']
df_females['class'].value_counts()/ len(df) * 100

class
Third     16.161616
First     10.549944
Second     8.529742
Name: count, dtype: float64

In [36]:
df_males= df[df['sex'] =='male']
df_males['class'].value_counts()/len(df)*100

class
Third     38.945006
First     13.692480
Second    12.121212
Name: count, dtype: float64

# Basic four demension

In [38]:
import pandas as pd
df= pd.read_excel(r"D:\Data_Science data\Python_ka_Chila\dataframe\titanic.xlsx")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Composition

In [42]:
df.shape
# print the number of row and columns
print(f'No of Rows: {df.shape[0]}\nNo of Columns: {df.shape[1]}')

No of Rows: 891
No of Columns: 15

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [46]:
df.dtypes
# print only the boolean columns
print(df.select_dtypes(include='bool').columns)

Index(['adult_male', 'alone'], dtype='object')

In [48]:
df.head()
df['sex'].value_counts()

sex
male      577
female    314
Name: count, dtype: int64

In [52]:
# find values count percentage for sex column
df['sex'].value_counts()/len(df)*100
# round of the value in 2 decimale
round(df['sex'].value_counts()/len(df)*100, 2)

sex
male      64.76
female    35.24
Name: count, dtype: float64

In [57]:
round(df['class'].value_counts()/len(df)*100, 2)
# sort the values in descending order
round(df['class'].value_counts()/len(df)*100, 2).sort_values(ascending=False)

class
Third     55.11
First     24.24
Second    20.65
Name: count, dtype: float64

In [58]:
round(df['deck'].value_counts()/len(df)*100, 2)
# sort the values in descending order
round(df['deck'].value_counts()/len(df)*100, 2).sort_values(ascending=False)

deck
C    6.62
B    5.27
D    3.70
E    3.59
A    1.68
F    1.46
G    0.45
Name: count, dtype: float64

In [61]:
# find the value count in percentage for class where sex ==female
df_females = df[df['sex'] == 'female']
df_females['class'].value_counts()/len(df)*100

class
Third     16.161616
First     10.549944
Second     8.529742
Name: count, dtype: float64

In [65]:
# groupby class and find the percentage of each class for sex columns
df.groupby(['sex']).value_counts()/len(df)*100

sex     class  survived  pclass  age   sibsp  parch  fare      embarked  who    adult_male  deck  embark_town  alive  alone
female  First  1         1       24.0  0      0      69.3000   C         woman  False       B     Cherbourg    yes    True     0.224467
               0         1       2.0   1      2      151.5500  S         child  False       C     Southampton  no     False    0.112233
                                 25.0  1      2      151.5500  S         woman  False       C     Southampton  no     False    0.112233
                                 50.0  0      0      28.7125   C         woman  False       C     Cherbourg    no     True     0.112233
               1         1       14.0  1      2      120.0000  S         child  False       B     Southampton  yes    False    0.112233
                                                                                                                                 ...
male    Third  0         3       19.0  0      0      7.6500    S         man    True        F     Southampton  no     True     0.112233
                                 25.0  0      0      7.6500    S         man    True        F     Southampton  no     True     0.112233
                                 42.0  0      0      7.6500    S         man    True        F     Southampton  no     True     0.112233
               1         3       6.0   0      1      12.4750   S         child  False       E     Southampton  yes    False    0.112233
                                 32.0  0      0      8.0500    S         man    True        E     Southampton  yes    True     0.112233
Name: count, Length: 181, dtype: float64

In [69]:
df.groupby(['sex', 'class']).size()/len(df)*100
round(df.groupby(['sex', 'class']).size()/len(df)*100,2).sort_values(ascending=False)

sex     class
male    Third     38.95
female  Third     16.16
male    First     13.69
        Second    12.12
female  First     10.55
        Second     8.53
dtype: float64

In [72]:
round(df.groupby(['sex','class', 'embarked']).size()/len(df)*100,2).sort_values(ascending=False)

sex     class   embarked
male    Third   S           29.74
        Second  S           10.89
female  Third   S            9.88
male    First   S            8.87
female  Second  S            7.52
        First   S            5.39
male    Third   C            4.83
female  First   C            4.83
male    First   C            4.71
        Third   Q            4.38
female  Third   Q            3.70
                C            2.58
male    Second  C            1.12
female  Second  C            0.79
                Q            0.22
        First   Q            0.11
male    Second  Q            0.11
        First   Q            0.11
dtype: float64